<template>
    <div class="newsinfo-container">
        <h3 class="title">《城南旧事》--节选</h3>
        <p class="subtitle">
            <span>发表时间：{{date | dateFormat}}</span>
            <span>点击：0次</span>
        </p>
        <div class="content">
<img src="http://www.ohhaha.top:8080/imgs/img_dazhaojishi.JPG" alt=""><br><br>
<p>&emsp;&emsp;因为放学后要练习跳舞，今天回来得晚一点儿。在兴华
门的土坡上，我还是习惯地站了一会儿。城墙上面的那片
天，是淡红的颜色了，海在这时也会变成红色的吗？我又默
默地背起“我们看海去！我们看海去！……金红的太阳，从海上升起来……，”那么现在不可以说是“金红的太阳，从天上落下去”吗？对的，我将来要写一本书，我要把天和海分清楚，我要把好人和坏人分清楚，我要把疯子和贼子分清楚，但是我现在却是什么也分不清。<br>
&emsp;&emsp;我从土坡上下来，边走边想，走到家门口，就在门墩儿
上坐下来，愣愣地没有伸手去拍门，因为我看见收买破烂货
的挑子又停在隔壁人家门口了。挑挑子的人呢？我不由得举
起脚步走向空草地那边去。这时门前的空地上，只见远远地
有一个男人蹲在大槐树底下，他没有注意我。我迈进破砖
墙，拨开高草，一步步向里走。<br>
&emsp;&emsp;还是那个老地方，我看见了他！<br>
&emsp;&emsp;“是你！”他也蹲在那里，嘴里咬着一根青草。他又向我
身后张望了一下。招手叫我也蹲下来。我一蹲下来，书包就
落在地上了。他小声地说：<br>
&emsp;&emsp;“放学啦？”<br>
&emsp;&emsp;“嗯。”<br>
&emsp;&emsp;“怎么不回家？”<br>
&emsp;&emsp;“我猜你在这里。”<br>
&emsp;&emsp;“你怎么就能猜出来呢？”他斜起头看我，我看他的
脸，很眼熟。<br>
&emsp;&emsp;“我呀！”我笑笑。我只是心里觉得这样，就来了，我并
不真地会猜什么事，“你该来了！”<br>
&emsp;&emsp;“我该来了？你这话是什么意思？”他惊奇地问。<br>
&emsp;&emsp;“没有什么意思呀！”我也惊奇地回答：“你还有故事没跟我讲哪！不是吗？”<br>
&emsp;&emsp;“对对对，咱们得讲信用。”他点点头笑了。他靠坐在墙
角，身旁有一大包东西，用油布包着，他就倚着这大包袱，好像宋妈坐在她的炕头上靠着被褥垛那样。<br>
&emsp;&emsp;“你要听什么故事儿？”<br>
&emsp;&emsp;“你弟弟的，你的。”<br>
&emsp;&emsp;“好，可是我先问你，我还不知道你叫什么名儿呢？”<br>
&emsp;&emsp;“英子。”<br>
&emsp;&emsp;“英子，英子，”他轻轻地念着，“名儿好听。在学堂考第几？”<br>
&emsp;&emsp;“第十二名。”<br>
&emsp;&emsp;“这么聪明的学生才考十二名？应当考第一呀！准是贪
玩分了你的心。”<br>
&emsp;&emsp;我笑了，他怎么知道我贪玩？我怎么能够不玩呢！<br>
&emsp;&emsp;他又接着说：<br>
&emsp;&emsp;“我就是小时候贪玩，书也没念成，后悔也来不及了。
我兄弟，那可是个好学生，年年考第一，有志气。他说，他
长大毕了业，还要飘洋过海去念书。我的天老爷，就凭我这
没出息的哥哥，什么能耐也没有，哪儿供得起呀！奔窝头，
我们娘儿仨，还常常吃了上顿没下顿呢！唉！”他叹了口气，
“走到这一步上，也是事非得已。小妹妹，明白我的话吗？”
我似懂，又不懂，只是直着眼看他。他的眼角有一堆眼
屎，眼睛红红的，好象昨天没睡觉，又象哭过似的。
“我那瞎老娘是为了我没出息哭瞎的，她现在就知道我
把家当花光了，改邪归正做小买卖，她不知道我别的。我那
一心啃书本的弟弟，更拿我当个好哥哥。可不是，我供弟弟
念书，一心要供到让他飘洋过海去念书，我不是个好人吗？小英子，你说我是好人？坏人？嗯？”<br>
&emsp;&emsp;好人，坏人，这是我最没有办法分清楚的事，怎么他也
来问我呢？我摇摇头。<br>
&emsp;&emsp;“不是好人？”他瞪起眼，指着自己的鼻子。<br>
&emsp;&emsp;我还是摇摇头。<br>
&emsp;&emsp;“不是坏人？”他笑了，眼泪从眼屎后面流出来。<br>
&emsp;&emsp;“我不懂什么好人，坏人，人太多了，很难分。”我抬头
看看天，忽然想起来了。“你分得清海跟天吗？我们有一课
书，我念给你听。”<br>
&emsp;&emsp;我就背起“我们看海去”那课书，我一句一句慢慢地
念，他斜着头仔细地听。我念一句，他点头“嗯”一声。念
完了我说：<br>
&emsp;&emsp;“金红的太阳是从蓝色的大海升上来的吗？可是它也从
蓝色的天空升上来呀？我分不出海跟天，我分不出好人跟坏
人。”<br>
&emsp;&emsp;“对，”他点点头很赞成我：“小妹妹，你的头脑好，将来总有一天你分得清这些。将来，等我那兄弟要坐大轮船去外
国念书的时候，咱们给他送行去，就可以看见大海了，看它
跟天有什么不一样。”<br>
&emsp;&emsp;“我们看海去！我们看海去！”我高兴得又念起来。<br>
&emsp;&emsp;“对，我们看海去，我们看海去，蓝色的大海上，扬着
白色的帆，……还有什么太阳来着？”<br>
&emsp;&emsp;“金红的太阳，从海上升起来，……”<br></p>
        </div>
        <div>
            <comment-box></comment-box>
        </div>
    </div>
</template>

<script>
// 导入子组件
import comment from '../subcomponents/comment.vue'

export default {
    data() {
        return {
            date: new Date()
        }
    },
    components: {
        "comment-box": comment
    }
}
</script>

<style lang="scss" scoped>
.newsinfo-container{
    padding: 0 4px;

    .title{
        font-size: 16px;
        text-align: center;
        margin: 15px 0;
        color: rgb(62, 131, 163);
    }
    .subtitle{
        font-size: 13px;
        color: #0796b9;
        display: flex;
        justify-content: space-between;
    }
    .content{
        img{
            width: 100%
        }
    }
}
</style>